geier99/STM32-CAN_CubeMX_Tests/STM32-Test/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include "main.h"
#include "usbd_cdc_if.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan1;
CAN_HandleTypeDef hcan2;

WWDG_HandleTypeDef hwwdg;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

//! Makro for the delay times
#define CAN_TRANSMIT_DELAY (100)
#define LED_TICKS (250)

//! Struktur auf alle Timer-Ticks Variablen  (maximal 255 Variablen)
typedef volatile struct timeoutticks_st {
    uint32_t canTransmitDelay;          // Verzögerungszeit bis nächste Tx-Message gesendet wird
    uint32_t ledTicks;                  // ticks für led blinken
} timeoutticks_t;

//! Status Flags from STM32-CAN device
typedef volatile struct stm32Status_st {
    interface_flags_t interface_flags;
    vu16 TimeStampCounter;
  
    uint32_t usbConnected ;              // set to 1 then stm32 is connected to usb and initialized
    
} stm32Status_t;


static timeoutticks_t TimeoutTicks = {     
    CAN_TRANSMIT_DELAY          // this have to be always the first entry
,   LED_TICKS   
};

static timeoutticks_t * const pTicks = &TimeoutTicks;  // I like pointers, so I use pointers :-)

static stm32Status_t stm32Status = {
    { 0,0,0,0 }     //flags
,   0               // timestamp counter        
,   0               // usb connected, not used    
};

static stm32Status_t * const pStatus = &stm32Status;


static CanTxMsgTypeDef myTxMessage;
static CanRxMsgTypeDef myRxMessage;
static CAN_FilterConfTypeDef myFilter;

unsigned char usbHelloMsg[]= "\nGreetings from USB device";

unsigned char usbLine[50];


volatile unsigned char myLastLine[MAX_USB_RECEIVED_BUFFER][MAX_USB_RECEIVED_BUFFER_LEN+1];   // Ablage Commandas Strings die per USB empfangen werden (+1 für die abschliesende 0 für Strings)
volatile unsigned char strReceivedCommando[MAX_USB_RECEIVED_BUFFER_LEN+1];                   // Buffer für eine komplette Zeile
volatile unsigned char strSendCommando[MAX_USB_RECEIVED_BUFFER_LEN+1];                       // eigneer Sendebuffer zum Test da eventuell die gemeinsame Nutzung von strReceivedCommando nicht funktioniert

volatile unsigned char myLastLinePosIdx = 0;     ;  // Spaltenindex von USB STring

// aa test
volatile unsigned char strStatusCommand[5];

volatile unsigned char myWriteIndexLastLine = 0  ;  //SchreibIndesx für den USB STring, wenn beide indexe gleich sind, dann liegt keine neue Nachricht im Buffer
volatile unsigned char myReadIndexLastLine  = 0  ;  // Lese Index für den USB




volatile enBitrate enCanBaudrate = _500_kbit;   // Merker des Indexes auf die Baudrate 0=500 1 250 ...usw.

//! Baudraten für den Sx Laviel-Protokoll setting Baudrate befehl   (Nummer von S ist der Index fürs Array)
const enBitrate usbBaudSettings[_LAST_BAUDRATE_]= {
    _10_kbit    // S0
,   _20_kbit    // S1
,   _50_kbit    // ...
,   _100_kbit
,   _125_kbit
,   _250_kbit
,   _500_kbit
,   _33_kbit
,   _95_kbit
,   _83_kbit   // S9
,   _47_kbit   // S10   not compatible to CAN-Hacker    
 };

const Bitrate_st stBitrate[COUNT_BITRATE]= {  // Reihenfolge ergibt sich von der Enumaration von  enum bitrate_t
//    PRESCal     BS1  BS2        // todo für stm
     { 6    , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 500kbit   S6  diese Werte gelten für einen Systemtakt von 72Mhz  PLCK1=32 MHz                         
,    { 12   , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 250kbit   S5                            
,    { 24   , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 125kbit   S4                            
,    { 30   , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 100kbit   S3                            
,    { 42   , CAN_BS1_6TQ, CAN_BS2_2TQ}  // 95kbit                               
,    { 36   , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 83kbit    S9                              
,    { 60   , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 50kbit  S2                             
,    { 90   , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 33kbit                               
,    { 150  , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 20kbit  S1 
,    { 300  , CAN_BS1_8TQ, CAN_BS2_3TQ}  // 10kbit  S0   
,    { 42   , CAN_BS1_12TQ, CAN_BS2_5TQ}  // 47,619kbit  S10   
};

 
