geier99/STM32-CAN_CubeMX_Tests/STM32-Test/Src/main.c
                    strReceivedCommando[0]=0x0D;             
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
                else {
                    if ( (strReceivedCommando[1] =='3') &&  (strReceivedCommando[2] =='3') \
                     &&  (strReceivedCommando[3] =='3') &&  (strReceivedCommando[4] =='3') \
                     &&  (!pStatus->interface_flags.CanChannelOnOff)  ) {  // gültige Zahl und Kanal geschlossen?
                        SetCanBaudrate(usbBaudSettings[_33_kbit]);
                        pStatus->interface_flags.BaudSettingsReceived=1;

                        strReceivedCommando[0]=0x0D;             
                        CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                    }
                    else {
                        if ( (strReceivedCommando[1] =='9') &&  (strReceivedCommando[2] =='5') \
                         &&  (strReceivedCommando[3] =='0') &&  (strReceivedCommando[4] =='0') \
                         &&  (!pStatus->interface_flags.CanChannelOnOff)  ) {  // gültige Zahl und Kanal geschlossen?
                            SetCanBaudrate(usbBaudSettings[_95_kbit]);
                            pStatus->interface_flags.BaudSettingsReceived=1;

                            strReceivedCommando[0]=0x0D;             
                            CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                        }
                        else {
                           // wrong parameter ==> send 0x07 
                            strReceivedCommando[0]=0x07;             
                            CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                            
                            // todo flag setzen, dass fehlerhafte Baudrate empfangen wurde und somit der OpenBefehl nicht ausgefürht werden darf,
                            // solange nicht eine korrekte benutzerdefinierte Baudreate bzw. ein S1..S9 empfangen wurde
                            pStatus->interface_flags.BaudSettingsReceived=0;  // because of wrong baudrate received don't execute "Channel Open"
                        }
                    }                    
                }
            break;
                
                
            case 'O':    // open CAN channel ( channel has to be closed)
                pStatus->interface_flags.CanSilentModeOnOff = 0x00;  // normaler Modus
                pStatus->TimeStampCounter=0;
                if((!pStatus->interface_flags.CanChannelOnOff) && (pStatus->interface_flags.BaudSettingsReceived)) { // Kanal geschlossen und Baudrate schon empfangen?

                    USER_CANx_Init(&hcan1,enCanBaudrate,CAN_MODE_NORMAL); 
                    USER_CANx_Init(&hcan2,enCanBaudrate,CAN_MODE_NORMAL); 

                    pStatus->interface_flags.CanChannelOnOff=1;  // set flag to status "opened"
                    strReceivedCommando[0]=0x0D;             
                    
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
                else {  // already opened
                    strReceivedCommando[0]=0x07;  

                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
            break;
    

            case 'C':       // close CAN channel    (channel has to be opened, befor it can be closed)
                if(pStatus->interface_flags.CanChannelOnOff) { // channel opened?

                    // todo aw: use also a macro to select which CANs are used, see above for the old version without HAL
                    HAL_CAN_DeInit(&hcan1);  // Deinit both CANs
                    HAL_CAN_DeInit(&hcan2);
    
                    pStatus->interface_flags.CanChannelOnOff=0;  // set flag to status "closed"
                    
                    strReceivedCommando[0]=0x0D;             
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 

                    HAL_GPIO_WritePin(LED_GREEN_GPIO_Port,LED_GREEN_Pin,GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_BLUE_GPIO_Port,LED_BLUE_Pin,GPIO_PIN_RESET);
                }
                else {  // already closed
                    strReceivedCommando[0]=0x07;             
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
            break;
                
                
            case 'L':  //listen only mode , only allowed to set when the CAN channel is closed
                    
                pStatus->interface_flags.CanSilentModeOnOff = 0x01;
                pStatus->TimeStampCounter=0;
            
                if((!pStatus->interface_flags.CanChannelOnOff) && (pStatus->interface_flags.BaudSettingsReceived)) { // Kanal geschlossen und Baudrate schon empfangen?
                    // todo aw : use macros for the available CAN channels
                    USER_CANx_Init(&hcan1,enCanBaudrate,CAN_MODE_SILENT); 
                    USER_CANx_Init(&hcan2,enCanBaudrate,CAN_MODE_SILENT); 

                    pStatus->interface_flags.CanChannelOnOff=1;  
                    strReceivedCommando[0]=0x0D;             
                    
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
                else {  // already opened
                    strReceivedCommando[0]=0x07;  

                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
            break;
                
            case 'Z':  // set timestamp status
                strReceivedCommando[0]=0x0D;  
                if(strReceivedCommando[1]=='1') {
                    pStatus->interface_flags.TimeStampOnOff=1;
                }
                else {
                    if (strReceivedCommando[1]=='0') {
                        pStatus->interface_flags.TimeStampOnOff=0;
                    }
                    else {  // unknown status, set error code for the response
                        strReceivedCommando[0]=0x07;  
                    }
                }
                CDC_Transmit_FS((u8 *)strReceivedCommando,1); 

            break;
                
            case 0x07:                              // Lawicel: error received?  also set by receiving more than 20 chars without [CR]
                CDC_Transmit_FS((unsigned char *)strReceivedCommando,1);
            
            default:
                strReceivedCommando[0]=0x07;        // send error back by receiving unknown command
                CDC_Transmit_FS((unsigned char *)strReceivedCommando,1);
            
            break;
         }   // end switch lawicel commands

        if(myReadIndexLastLine < (MAX_USB_RECEIVED_BUFFER - 1)) {   
            myReadIndexLastLine += 1;                                  
        }
        else {
            myReadIndexLastLine = 0;
        }
    }  // end new command string received
    
    // handle  the received CAN-Frames:
    if(CanReceivedCounter) {       //  // Liegt eine CAN-Message im Empfangsbuffer?    Ja dann auf gleichen Port zum senden merken
        u8 idx=0;
        u8 db;
        u8 DLC;
        u32 ID;
        
        DLC=stLastRxMessage[rx_rd_CAN_index].LastRxMessage.DLC;
        
