geier99/STM32-CAN_CubeMX_Tests/STM32-Test/Src/main.c
}

/* USER CODE BEGIN 4 */
void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* hcan) {
    u32 j;
    HAL_GPIO_TogglePin(LED_BLUE_GPIO_Port,LED_BLUE_Pin);
    // valid CAN-Message received
    
    // todo managed received data, 
    //only the the received can-messages will be put into the rx-buffer
    // and also fifo0 is used 
    // please note that this is an import of my STM32 interface which didn't use CubeMX, so maybe it not a good implementation :-(
    // also the RxMessag structure differ, I only used the values whcih I need,
    
    stLastRxMessage[rx_wr_CAN_index].LastRxMessage.IDE =  hcan1.pRxMsg->IDE;
    if(CAN_ID_STD == hcan1.pRxMsg->IDE) {
         stLastRxMessage[rx_wr_CAN_index].LastRxMessage.StdId =  hcan1.pRxMsg->StdId;
    }
    else {
         stLastRxMessage[rx_wr_CAN_index].LastRxMessage.ExtId =  hcan1.pRxMsg->ExtId;     
    }
    stLastRxMessage[rx_wr_CAN_index].LastRxMessage.DLC =  hcan1.pRxMsg->DLC; 
    
    for(j=0;j<8;j++) { // copy all 8 data bytes , don't take care about DLC
        stLastRxMessage[rx_wr_CAN_index].LastRxMessage.Data[j] = hcan1.pRxMsg->Data[j];
    }
    
	stLastRxMessage[rx_wr_CAN_index].pCAN=CAN1;                                      // CAN-Schnittstelle speichern
    
    stLastRxMessage[rx_wr_CAN_index].timeStamp = pStatus->TimeStampCounter;

         
    if(++rx_wr_CAN_index == MYRX_SIZE)  rx_wr_CAN_index=0;                           // Write Index auf Anfang vom Puffer setzen  
    if(++CanReceivedCounter == MYRX_SIZE) {
        CanReceivedCounter=0;    // bei Bufferüberlauf Counter zurücksetzen, dadurch gehen Nachrichten verloren, sollte aber nie vorkommen
    }        
   
    
    // when release fifo0 ISR Bit
    __HAL_CAN_ENABLE_IT(hcan, CAN_IT_FMP0);  // achtung kein check auf welchen Buffer, hier fest 0
    
}

/**
  * @brief  Own-Systik Handler 
  *         
  * This function is called every 1ms. This function is used to handle the won pTicks structurel.<br>
  * maximal 255 tick variables are allowed 
  *
  */
void HAL_SYSTICK_Callback(void){  // handle own additional systicks
    uint32_t i;
    volatile uint32_t *pTick = &TimeoutTicks.canTransmitDelay ;    // this have to be the first variable in the timeticks

    // decrement all tick varriable 
    for (i=0; i < ( sizeof(timeoutticks_t) / sizeof(uint32_t));i++) {
        if (*pTick) {
            (*pTick)--;
        }
        pTick++;
    }

    if (++pStatus->TimeStampCounter > END_VALUE_TIMESTAMP_COUNTER) {  // Zähler nur von 0....59999ms laufen lassen)
        pStatus->TimeStampCounter=0;
    }

    
    
}

/**
  * @brief  CAN Baudrate setzen
  *         Baudrate für die CAN-Interfaces auf einen festen Wert setzen, <br>so das keine Autobauderkennung erforderlich ist.
  * @param  None
  * @retval None
  */
void SetCanBaudrate(enBitrate enBaud) {  //
      enCanBaudrate=enBaud; 
}


/**
  * @brief  User CAN initialization 
  *         Setup the CAN port with the Lawicel baudrate
  * @param  CAN_HandleTypeDef *hCANx
  * @todo   impelentation and testing
  * @note   the basic initializing is done by the cubeMX, here only baudratesettings is don
  * @retval None
  */

static void USER_CANx_Init(CAN_HandleTypeDef *hCANx,enBitrate baud, uint32_t canMode){
  
  //   
  
  hCANx->Init.Prescaler = stBitrate[baud].Prescaler;
  hCANx->Init.Mode = canMode;
  hCANx->Init.SJW =  CAN_SJW_1TQ; // always zero , which means the Synchronization Jump Width is 1 tq
  hCANx->Init.BS1 = stBitrate[baud].BS1;
  hCANx->Init.BS2 = stBitrate[baud].BS2;

  // since here should be set ,   
/*
  hCANx->Init.TTCM = DISABLE;
  hCANx->Init.ABOM = ENABLE;
  hCANx->Init.AWUM = DISABLE;
  hCANx->Init.NART = DISABLE;
  hCANx->Init.RFLM = DISABLE;
  hCANx->Init.TXFP = DISABLE;
*/
    
  HAL_CAN_Init(hCANx);
 
    
    
}





/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
